package com.example.myapplication

object StageRepository {

    val stages = listOf(

// =====================
// 1. 台灣
// =====================
        Stage(
            title = "台灣",
            guide = "一直派貓咪就行",
            recommendedCats = listOf("貓咪"),
            enemies = listOf(
                EnemyInfo("狗仔", "1", 0, "-"),
                EnemyInfo("狗仔", "無限", 600, "180~300")
            )
        ),

// =====================
// 2. 香港
// =====================
        Stage(
            title = "香港",
            guide = "一直派貓咪就好(升級錢包直到4級)",
            recommendedCats = listOf("貓咪"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "180~300"),
                EnemyInfo("扭扭蛇", "無限", 600, "300~800")
            )
        ),
// =====================
// 3. 泰國
// =====================
        Stage(
            title = "泰國",
            guide = "一直派貓咪就好(升級錢包直到4級)",
            recommendedCats = listOf("貓咪"),
            enemies = listOf(
                EnemyInfo("狗仔", "3", 20, "800"),
                EnemyInfo("扭扭蛇", "3", 300, "800"),
                EnemyInfo("團結筷子幫", "2", 500, "500"),
                EnemyInfo("扭扭蛇", "2", 900, "400")
            )
        ),

// =====================
// 4. 中國
// =====================
        Stage(
            title = "中國",
            guide = "一直派貓咪就好(升級錢包到4級)",
            recommendedCats = listOf("貓咪"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "180~300"),
                EnemyInfo("扭扭蛇", "無限", 0, "300~800"),
                EnemyInfo("團結筷子幫", "無限", 1200, "300~800")
            )
        ),
// =====================
// 5. 馬爾地夫
// =====================
        Stage(
            title = "蒙古",
            guide = "一直派貓咪就好(升級錢包直到4級)",
            recommendedCats = listOf("貓咪"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "180~300"),
                EnemyInfo("扭扭蛇", "無限", 0, "300~800"),
                EnemyInfo("團結筷子幫", "無限", 1200, "300~800")

            )
        ),

        // =====================
// 6. 韓國
// =====================
        Stage(
            title = "韓國",
            guide = "一直派貓咪就好(升級錢包直到4級)",
            recommendedCats = listOf("貓咪"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "180~300"),
                EnemyInfo("扭扭蛇", "無限", 0, "300~800"),
                EnemyInfo("團結筷子幫", "無限", 1200, "300~800")
            )
        ),

// =====================
// 7. 日本
// =====================
        Stage(
            title = "日本",
            guide = "升級前面獲得的噁心貓，並用貓咪掩護，開局存好錢在打",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "320~560"),
                EnemyInfo("扭扭蛇", "無限", 0, "600~1600"),
                EnemyInfo("團結筷子幫", "無限", 1200, "600~1600"),
                EnemyInfo("團結筷子幫", "6", 0, "60~120"),
                EnemyInfo("河馬將（魔王）", "1", 0, "-")
            )
        ),

// =====================
// 8. 澳大利亞
// =====================
        Stage(
            title = "澳大利亞",
            guide = "升級前面獲得的噁心貓，並用貓咪掩護",
            recommendedCats = listOf("貓咪，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "180~300"),
                EnemyInfo("扭扭蛇", "無限", 300, "300~800"),
                EnemyInfo("團結筷子幫", "無限", 600, "300~800"),
                EnemyInfo("團結筷子幫", "20", 0, "30~60")
            )
        ),

// =====================
// 9. 新加坡
// =====================
        Stage(
            title = "新加坡",
            guide = "升級前面獲得的噁心貓，並用貓咪掩護(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "120~300"),
                EnemyInfo("狗仔", "無限", 900, "180~900"),
                EnemyInfo("扭扭蛇", "無限", 1800, "300~900"),
                EnemyInfo("團結筷子幫", "無限", 2700, "300~900"),
                EnemyInfo("團結筷子幫", "20", 0, "2~4")
            )
        ),

// =====================
// 10. 馬爾地夫
// =====================
        Stage(
            title = "馬爾地夫",
            guide = "升級前面獲得的噁心貓，並用貓咪掩護(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "320~560"),
                EnemyInfo("扭扭蛇", "無限", 240, "600~1600"),
                EnemyInfo("團結筷子幫", "無限", 1200, "600~1600"),
                EnemyInfo("團結筷子幫", "6", 0, "60~120"),
                EnemyInfo("豬野郎（魔王）", "1", 0, "-")
            )
        ),

// =====================
// 11. 印度
// =====================
        Stage(
            title = "印度",
            guide = "升級前面獲得的噁心貓，並用貓咪掩護(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "320~560"),
                EnemyInfo("扭扭蛇", "無限", 240, "600~1600"),
                EnemyInfo("團結筷子幫", "無限", 1200, "300~1200"),
                EnemyInfo("團結筷子幫", "6", 0, "60~120"),
                EnemyInfo("河馬將", "1", 0, "-"),
                EnemyInfo("河馬將", "1", 0, "-")
            )
        ),

// =====================
// 12. 尼泊爾
// =====================
        Stage(
            title = "尼泊爾",
            guide = "升級前面獲得的噁心貓，並用貓咪，坦克貓掩護(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "320~560"),
                EnemyInfo("扭扭蛇", "無限", 240, "600~1600"),
                EnemyInfo("團結筷子幫", "無限", 1200, "300~1200"),
                EnemyInfo("團結筷子幫", "6", 0, "60~120"),
                EnemyInfo("豬野郎", "1", 0, "-"),
                EnemyInfo("豬野郎", "1", 0, "-")
            )
        ),

        // =====================
// 13. 杜拜
// =====================
        Stage(
            title = "杜拜",
            guide = "升級前面獲得的噁心貓，並用貓咪，坦克貓掩護(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "200~400"),
                EnemyInfo("扭扭蛇", "無限", 600, "200~400"),
                EnemyInfo("團結筷子幫", "無限", 1200, "200~400"),
                EnemyInfo("團結筷子幫", "6", 0, "60~120"),
                EnemyInfo("團結筷子幫", "無限", 0, "100~400"),
                EnemyInfo("企鵝大哥", "1", 0, "-"),
                EnemyInfo("企鵝大哥", "1", 0, "-")
            )
        ),

// =====================
// 14. 沙烏地阿拉伯
// =====================
        Stage(
            title = "沙烏地阿拉伯",
            guide = "使用噁心貓，並用貓咪，坦克貓掩護(滿等就換升級坦克貓和錢包跟加錢速度，都升完升鳥貓)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "640~1120"),
                EnemyInfo("扭扭蛇", "無限", 600, "1200~2400"),
                EnemyInfo("團結筷子幫", "無限", 1200, "1200~2400"),
                EnemyInfo("團結筷子幫", "6", 0, "60~120"),
                EnemyInfo("河馬將", "1", 0, "-"),
                EnemyInfo("河馬將", "1", 0, "-")
            )
        ),

// =====================
// 15. 肯亞
// =====================
        Stage(
            title = "肯亞",
            guide = "使用噁心貓，並用貓咪，坦克貓掩護(滿等就換升級坦克貓和錢包跟加錢速度，都升完升鳥貓)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "30~300"),
                EnemyInfo("扭扭蛇", "無限", 600, "300~600"),
                EnemyInfo("團結筷子幫", "無限", 1200, "600~1200"),
                EnemyInfo("團結筷子幫", "8", 600, "20~60"),
                EnemyInfo("豬野郎", "1", 4000, "-"),
                EnemyInfo("河馬將", "1", 8400, "-"),
                EnemyInfo("豬野郎", "1", 1800, "-"),
                EnemyInfo("河馬將", "1", 2400, "-")
            )
        ),

// =====================
// 16. 馬達加斯加
// =====================
        Stage(
            title = "馬達加斯加",
            guide = "升級前面獲得的鳥貓，並用貓咪，坦克貓掩護，噁心貓鳥貓進攻(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("團結筷子幫", "無限", 0, "30~300"),
                EnemyInfo("狗仔", "無限", 0, "300~600"),
                EnemyInfo("團結筷子幫", "無限", 0, "300~600"),
                EnemyInfo("團結筷子幫", "12", 600, "20~60"),
                EnemyInfo("大猩猩", "1", 0, "-"),
                EnemyInfo("大猩猩（魔王）", "1", 0, "-")
            )
        ),

// =====================
// 17. 南非
// =====================
        Stage(
            title = "南非",
            guide = "升級前面獲得的鳥貓，並用貓咪，坦克貓掩護，噁心貓鳥貓進攻(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "30~300"),
                EnemyInfo("扭扭蛇", "無限", 0, "30~300"),
                EnemyInfo("團結筷子幫", "無限", 0, "30~300"),
                EnemyInfo("企鵝大哥", "1", 3000, "-"),
                EnemyInfo("企鵝大哥", "1", 3060, "-"),
                EnemyInfo("豬野郎", "無限", 4000, "1200~1800"),
                EnemyInfo("河馬將", "無限", 4000, "1200~1800"),
                EnemyInfo("企鵝大哥", "1", 0, "-"),
                EnemyInfo("企鵝大哥", "1", 0, "-")
            )
        ),

// =====================
// 18. 迦納
// =====================
        Stage(
            title = "迦納",
            guide = "升級前面獲得的鳥貓，並用貓咪，坦克貓掩護，噁心貓鳥貓進攻(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "30~300"),
                EnemyInfo("扭扭蛇", "無限", 0, "30~300"),
                EnemyInfo("團結筷子幫", "無限", 0, "30~300"),
                EnemyInfo("企鵝大哥", "1", 3000, "-"),
                EnemyInfo("豬野郎", "無限", 4000, "1200~1800"),
                EnemyInfo("企鵝大哥", "無限", 4000, "1200~1800"),
                EnemyInfo("企鵝大哥", "1", 0, "-"),
                EnemyInfo("企鵝大哥", "1", 0, "-"),
                EnemyInfo("企鵝大哥", "1", 0, "-"),
                EnemyInfo("企鵝大哥", "1", 0, "-")
            )
        ),

// =====================
// 19. 撒哈拉沙漠
// =====================
        Stage(
            title = "撒哈拉沙漠",
            guide = "升級前面獲得的鳥貓，並用貓咪，坦克貓掩護，噁心貓鳥貓進攻(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("團結筷子幫", "無限", 0, "30~600"),
                EnemyInfo("團結筷子幫", "無限", 0, "30~600"),
                EnemyInfo("團結筷子幫", "無限", 300, "30~300"),
                EnemyInfo("大猩猩", "1", 3000, "-"),
                EnemyInfo("咩咩", "無限", 1800, "30~300"),
                EnemyInfo("大猩猩", "2", 4000, "2"),
                EnemyInfo("咩咩", "10", 0, "30~60")
            )
        ),

// =====================
// 20. 埃及
// =====================
        Stage(
            title = "埃及",
            guide = "升級前面獲得的鳥貓，並用貓咪，坦克貓掩護，噁心貓鳥貓進攻(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "30~300"),
                EnemyInfo("扭扭蛇", "無限", 0, "30~300"),
                EnemyInfo("團結筷子幫", "無限", 300, "30~300"),
                EnemyInfo("咩咩", "無限", 1800, "30~300"),
                EnemyInfo("豬野郎", "無限", 1800, "1800~3600"),
                EnemyInfo("河馬將", "無限", 2400, "1800~3600"),
                EnemyInfo("大猩猩", "4", 4000, "1800~3600")
            )
        ),

// =====================
// 21. 土耳其
// =====================
        Stage(
            title = "土耳其",
            guide = "升級前面獲得的鳥貓，並用貓咪，坦克貓掩護，噁心貓鳥貓進攻(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "30~300"),
                EnemyInfo("扭扭蛇", "無限", 0, "30~300"),
                EnemyInfo("團結筷子幫", "無限", 0, "30~300"),
                EnemyInfo("咩咩", "無限", 1800, "30~300"),
                EnemyInfo("豬野郎", "無限", 1800, "1800~3600"),
                EnemyInfo("河馬將", "無限", 2400, "1800~3600"),
                EnemyInfo("大猩猩", "無限", 4000, "1800~3600"),
                EnemyInfo("企鵝大哥", "無限", 2400, "1800~3600")
            )
        ),

// =====================
// 22. 俄羅斯
// =====================
        Stage(
            title = "俄羅斯",
            guide = "升級前面獲得的鳥貓，並用貓咪，坦克貓掩護，噁心貓鳥貓進攻(滿等就換升級坦克貓和錢包跟加錢速度)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("扭扭蛇", "無限", 0, "30~300"),
                EnemyInfo("扭扭蛇", "無限", 0, "30~300"),
                EnemyInfo("團結筷子幫", "無限", 0, "30~300"),
                EnemyInfo("咩咩", "無限", 0, "30~300"),
                EnemyInfo("企鵝大哥", "1", 0, "-"),
                EnemyInfo("大猩猩", "2", 0, "2~60"),
                EnemyInfo("大猩猩", "2", 0, "2~60"),
                EnemyInfo("大猩猩", "2", 0, "2~60")
            )
        ),

        // =====================
// 23. 希臘
// =====================
        Stage(
            title = "希臘",
            guide = "使用噁心貓鳥貓進攻，並用貓咪，坦克貓掩護，(滿等就換升級龍貓)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("團結筷子幫", "無限", 0, "30~120"),
                EnemyInfo("豬野郎", "1", 300, "-"),
                EnemyInfo("團結筷子幫", "無限", 0, "30~60"),
                EnemyInfo("斑海豹桑（魔王）", "1", 0, "-")
            )
        ),

// =====================
// 24. 義大利
// =====================
        Stage(
            title = "義大利",
            guide = "使用噁心貓鳥貓進攻，並用貓咪，坦克貓掩護，(滿等就換升級龍貓)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("河馬將", "無限", 0, "300~1200"),
                EnemyInfo("豬野郎", "無限", 0, "300~1200"),
                EnemyInfo("企鵝大哥", "無限", 0, "300~1200"),
                EnemyInfo("大猩猩", "無限", 0, "300~1200"),
                EnemyInfo("大猩猩", "1", 5400, "-"),
                EnemyInfo("企鵝大哥", "1", 3600, "-"),
                EnemyInfo("豬野郎", "1", 1800, "-"),
                EnemyInfo("河馬將", "1", 0, "-")
            )
        ),

// =====================
// 25. 摩納哥
// =====================
        Stage(
            title = "摩納哥",
            guide = "使用噁心貓鳥貓進攻，並用貓咪，坦克貓掩護，(滿等就換升級龍貓)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "30~300"),
                EnemyInfo("扭扭蛇", "無限", 300, "30~300"),
                EnemyInfo("團結筷子幫", "無限", 600, "30~60"),
                EnemyInfo("河馬將", "1", 1200, "-"),
                EnemyInfo("咩咩", "無限", 0, "130~240"),
                EnemyInfo("企鵝大哥", "無限", 0, "130~240")
            )
        ),

// =====================
// 26. 西班牙
// =====================
        Stage(
            title = "西班牙",
            guide = "使用噁心貓鳥貓進攻，並用貓咪，坦克貓掩護(優先鳥貓後噁心貓)，(滿等就換升級龍貓)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("鱷魚宅宅", "1", 0, "-"),
                EnemyInfo("鱷魚宅宅", "無限", 300, "160~240"),
                EnemyInfo("鱷魚宅宅", "無限", 900, "120~240"),
                EnemyInfo("鱷魚宅宅", "無限", 0, "90~240"),
                EnemyInfo("鱷魚宅宅", "無限", 0, "90~240"),
                EnemyInfo("鱷魚宅宅", "無限", 0, "2~60"),
                EnemyInfo("鱷魚宅宅", "無限", 0, "120~300"),
                EnemyInfo("斑海豹桑", "1", 0, "-")
            )
        ),

// =====================
// 27. 法國
// =====================
        Stage(
            title = "法國",
            guide = "使用噁心貓鳥貓進攻，並用貓咪，坦克貓掩護(優先鳥貓後噁心貓)，(滿等就換升級龍貓)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "100~400"),
                EnemyInfo("扭扭蛇", "無限", 300, "200~800"),
                EnemyInfo("團結筷子幫", "無限", 600, "360~1440"),
                EnemyInfo("鱷魚宅宅", "無限", 1200, "600~2400"),
                EnemyInfo("咩咩", "無限", 1800, "760~3040"),
                EnemyInfo("大猩猩", "無限", 2400, "900~1800"),
                EnemyInfo("斑海豹桑", "無限", 3600, "900~1800")
            )
        ),

        // =====================
// 28. 德國
// =====================
        Stage(
            title = "德國",
            guide = "使用噁心貓鳥貓進攻，並用貓咪，坦克貓掩護，(滿等就換升級龍貓)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "100~400"),
                EnemyInfo("扭扭蛇", "無限", 300, "150~200"),
                EnemyInfo("團結筷子幫", "無限", 600, "200~300"),
                EnemyInfo("鱷魚宅宅", "無限", 1200, "300~600"),
                EnemyInfo("大猩猩", "無限", 4800, "900~1800"),
                EnemyInfo("斑海豹桑", "無限", 6000, "900~1800"),
                EnemyInfo("企鵝大哥", "無限", 2400, "900~1800"),
                EnemyInfo("河馬將", "無限", 3600, "900~1800"),
                EnemyInfo("豬野郎", "無限", 3600, "900~1800")
            )
        ),

// =====================
// 29. 丹麥
// =====================
        Stage(
            title = "丹麥",
            guide = "使用噁心貓鳥貓進攻，並用貓咪掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("貓咪，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "100~900"),
                EnemyInfo("扭扭蛇", "無限", 300, "300~600"),
                EnemyInfo("團結筷子幫", "無限", 600, "300"),
                EnemyInfo("鱷魚宅宅", "無限", 1200, "300~1200"),
                EnemyInfo("團結筷子幫", "無限", 0, "2~30"),
                EnemyInfo("團結筷子幫", "20", 0, "2"),
                EnemyInfo("澎湃（魔王）", "1", 0, "-")
            )
        ),

// =====================
// 30. 挪威
// =====================
        Stage(
            title = "挪威",
            guide = "使用噁心貓，龍貓進攻，並用貓咪掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("貓咪，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("扭扭蛇", "無限", 300, "150~200"),
                EnemyInfo("團結筷子幫", "無限", 600, "200~300"),
                EnemyInfo("鱷魚宅宅", "無限", 1200, "300~600"),
                EnemyInfo("咩咩", "無限", 1800, "300~600"),
                EnemyInfo("大猩猩", "無限", 4800, "900~1800"),
                EnemyInfo("斑海豹桑", "無限", 6000, "900~1800"),
                EnemyInfo("企鵝大哥", "無限", 2400, "900~1800"),
                EnemyInfo("河馬將", "無限", 3600, "900~1800"),
                EnemyInfo("豬野郎", "無限", 3600, "900~1800")
            )
        ),

// =====================
// 31. 英國
// =====================
        Stage(
            title = "英國",
            guide = "使用噁心貓，龍貓進攻，並用貓咪掩護，錢不要花太快，(滿等就換升級後面的)",
            recommendedCats = listOf("貓咪，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("鱷魚宅宅", "無限", 0, "100~300"),
                EnemyInfo("團結筷子幫", "無限", 300, "150~300"),
                EnemyInfo("咩咩", "無限", 600, "200~300"),
                EnemyInfo("澎湃", "1", 1800, "-"),
                EnemyInfo("豬野郎", "無限", 5400, "600~1200")
            )
        ),

// =====================
// 32. 格陵蘭島
// =====================
        Stage(
            title = "格陵蘭島",
            guide = "使用噁心貓，龍貓進攻，並用貓咪掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("貓咪，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("團結筷子幫", "無限", 0, "100~400"),
                EnemyInfo("臭老兔", "無限", 600, "60~300"),
                EnemyInfo("斑海豹桑", "無限", 1800, "600~1200"),
                EnemyInfo("豬野郎", "無限", 1200, "600~1200"),
                EnemyInfo("臭老兔", "無限", 0, "60~300"),
                EnemyInfo("臭老兔", "無限", 1200, "60~300"),
                EnemyInfo("豬野郎", "1", 0, "-")
            )
        ),

        // =====================
// 33. 加拿大
// =====================
        Stage(
            title = "加拿大",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("扭扭蛇", "無限", 300, "150~200"),
                EnemyInfo("團結筷子幫", "無限", 600, "200~300"),
                EnemyInfo("鱷魚宅宅", "無限", 1200, "300~600"),
                EnemyInfo("咩咩", "無限", 1800, "300~600"),
                EnemyInfo("大猩猩", "無限", 3000, "900~1800"),
                EnemyInfo("斑海豹桑", "無限", 6000, "900~1800"),
                EnemyInfo("企鵝大哥", "無限", 2400, "900~1800"),
                EnemyInfo("河馬將", "無限", 3600, "900~1800"),
                EnemyInfo("豬野郎", "無限", 3600, "900~1800"),
                EnemyInfo("大猩猩", "無限", 4000, "900~1800"),
                EnemyInfo("大猩猩", "4", 0, "2")
            )
        ),

// =====================
// 34. 紐約
// =====================
        Stage(
            title = "紐約",
            guide = "使用噁心貓，龍貓進攻，並用貓咪掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("貓咪，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("扭扭蛇", "無限", 300, "150~200"),
                EnemyInfo("團結筷子幫", "無限", 600, "200~300"),
                EnemyInfo("鱷魚宅宅", "無限", 1200, "300~600"),
                EnemyInfo("咩咩", "無限", 1800, "300~600"),
                EnemyInfo("大猩猩", "無限", 3000, "900~1800"),
                EnemyInfo("斑海豹桑", "無限", 6000, "2000~4000"),
                EnemyInfo("企鵝大哥", "無限", 2400, "900~1800"),
                EnemyInfo("河馬將", "無限", 3600, "900~1800"),
                EnemyInfo("豬野郎", "無限", 3600, "900~1800"),
                EnemyInfo("豬野郎", "無限", 4000, "900~1800"),
                EnemyInfo("斑海豹桑", "1", 0, "-"),
                EnemyInfo("斑海豹桑", "1", 0, "-"),
                EnemyInfo("斑海豹桑", "1", 0, "-"),
                EnemyInfo("斑海豹桑", "1", 0, "-")
            )
        ),

// =====================
// 35. 百慕達
// =====================
        Stage(
            title = "百慕達",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "120~400"),
                EnemyInfo("扭扭蛇", "無限", 400, "120~400"),
                EnemyInfo("團結筷子幫", "無限", 1800, "120~400"),
                EnemyInfo("鱷魚宅宅", "無限", 2400, "300~600"),
                EnemyInfo("臭老兔", "無限", 3000, "300~600"),
                EnemyInfo("袋拳（魔王）", "1", 0, "-")
            )
        ),

// =====================
// 36. 牙買加
// =====================
        Stage(
            title = "牙買加",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "100~300"),
                EnemyInfo("扭扭蛇", "無限", 400, "100~300"),
                EnemyInfo("團結筷子幫", "無限", 1800, "100~300"),
                EnemyInfo("鱷魚宅宅", "無限", 2400, "100~300"),
                EnemyInfo("臭老兔", "無限", 3000, "100~400"),
                EnemyInfo("咩咩", "無限", 3000, "100~600"),
                EnemyInfo("河馬將", "無限", 3600, "600~1200"),
                EnemyInfo("豬野郎", "無限", 3600, "600~1200"),
                EnemyInfo("澎湃", "1", 3000, "-"),
                EnemyInfo("澎湃", "無限", 7000, "4000~6000")
            )
        ),

// =====================
// 37. 哥倫比亞
// =====================
        Stage(
            title = "哥倫比亞",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "100~300"),
                EnemyInfo("扭扭蛇", "無限", 400, "100~300"),
                EnemyInfo("團結筷子幫", "無限", 200, "100~300"),
                EnemyInfo("鱷魚宅宅", "無限", 2400, "100~300"),
                EnemyInfo("臭老兔", "無限", 3000, "100~400"),
                EnemyInfo("咩咩", "無限", 3000, "100~600"),
                EnemyInfo("河馬將", "無限", 3600, "600~1200"),
                EnemyInfo("豬野郎", "無限", 3600, "600~1200"),
                EnemyInfo("袋拳", "1", 3000, "-"),
                EnemyInfo("袋拳", "1", 5000, "-")
            )
        ),

        // =====================
// 38. 巴西
// =====================
        Stage(
            title = "巴西",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "300~900"),
                EnemyInfo("團結筷子幫", "無限", 0, "300~900"),
                EnemyInfo("團結筷子幫", "無限", 0, "30~300"),
                EnemyInfo("松鼠阿嘎", "無限", 900, "300~900"),
                EnemyInfo("大猩猩", "1", 0, "-"),
                EnemyInfo("大猩猩", "1", 0, "-"),
                EnemyInfo("大猩猩", "1", 0, "-"),
                EnemyInfo("大猩猩", "1", 0, "-"),
                EnemyInfo("鱷魚宅宅", "無限", 0, "30~300"),
                EnemyInfo("松鼠阿嘎", "無限", 0, "30~300"),
                EnemyInfo("蛾蛾蛾蛾（魔王）", "1", 0, "-")
            )
        ),

// =====================
// 39. 阿根廷
// =====================
        Stage(
            title = "阿根廷",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "90~420"),
                EnemyInfo("扭扭蛇", "無限", 0, "90~420"),
                EnemyInfo("團結筷子幫", "無限", 1200, "180~420"),
                EnemyInfo("松鼠阿嘎", "無限", 2400, "180~420"),
                EnemyInfo("大猩猩", "無限", 2000, "2000~3000"),
                EnemyInfo("斑海豹桑", "無限", 2600, "2000~3000"),
                EnemyInfo("企鵝大哥", "無限", 3200, "2000~3000"),
                EnemyInfo("大猩猩", "3", 0, "2"),
                EnemyInfo("企鵝大哥", "8", 0, "2"),
                EnemyInfo("斑海豹桑", "4", 0, "2")
            )
        ),

// =====================
// 40. 馬丘比丘
// =====================
        Stage(
            title = "馬丘比丘",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "90~420"),
                EnemyInfo("扭扭蛇", "無限", 0, "90~420"),
                EnemyInfo("團結筷子幫", "無限", 1200, "180~420"),
                EnemyInfo("松鼠阿嘎", "無限", 2400, "180~420"),
                EnemyInfo("大猩猩", "無限", 2000, "2000~3000"),
                EnemyInfo("斑海豹桑", "無限", 2600, "2000~3000"),
                EnemyInfo("企鵝大哥", "無限", 1200, "600~900"),
                EnemyInfo("大猩猩", "無限", 2400, "1200~1800"),
                EnemyInfo("澎湃", "無限", 3000, "3000"),
                EnemyInfo("袋拳", "1", 0, "-"),
                EnemyInfo("袋拳", "1", 0, "-")
            )
        ),

// =====================
// 41. 復活島
// =====================
        Stage(
            title = "復活島",
            guide = "使用噁心貓，鳥貓進攻，並用貓咪掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("貓咪，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("團結筷子幫", "無限", 0, "30~300"),
                EnemyInfo("鱷魚宅宅", "無限", 600, "300~900"),
                EnemyInfo("松鼠阿嘎", "無限", 0, "30~500"),
                EnemyInfo("一角君", "1", 0, "-"),
                EnemyInfo("一角君（魔王）", "1", 0, "-")
            )
        ),

// =====================
// 42. 墨西哥
// =====================
        Stage(
            title = "墨西哥",
            guide = "使用噁心貓，鳥貓進攻，並用貓咪，坦克貓掩護，(滿等就換升級後面的)",
            recommendedCats = listOf("貓咪，坦克貓，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "90~420"),
                EnemyInfo("扭扭蛇", "無限", 0, "90~420"),
                EnemyInfo("團結筷子幫", "無限", 1200, "180~420"),
                EnemyInfo("松鼠阿嘎", "無限", 2400, "180~420"),
                EnemyInfo("大猩猩", "無限", 2000, "1800~2400"),
                EnemyInfo("斑海豹桑", "無限", 2600, "2000~3000"),
                EnemyInfo("企鵝大哥", "無限", 1200, "600~900"),
                EnemyInfo("大猩猩", "無限", 2400, "300~900"),
                EnemyInfo("澎湃", "無限", 3000, "3000"),
                EnemyInfo("袋拳", "1", 4200, "-"),
                EnemyInfo("袋拳", "1", 0, "-"),
                EnemyInfo("袋拳", "1", 0, "-")
            )
        ),

        // =====================
// 43. 美國太空總署
// =====================
        Stage(
            title = "美國太空總署",
            guide = "使用噁心貓，鳥貓進攻，並用貓咪掩護，(滿等就換升級魚貓)",
            recommendedCats = listOf("貓咪，噁心貓，鳥貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "90~600"),
                EnemyInfo("扭扭蛇", "無限", 0, "90~600"),
                EnemyInfo("團結筷子幫", "無限", 1200, "90~600"),
                EnemyInfo("鱷魚宅宅", "無限", 600, "90~600"),
                EnemyInfo("臭老兔", "無限", 600, "90~600"),
                EnemyInfo("豬野郎", "無限", 900, "900~1800"),
                EnemyInfo("斑海豹桑", "無限", 1800, "900~1800"),
                EnemyInfo("臭老兔", "無限", 2700, "900~1800"),
                EnemyInfo("一角君", "1", 600, "-"),
                EnemyInfo("一角君", "1", 0, "-"),
                EnemyInfo("一角君", "1", 0, "-")
            )
        ),

// =====================
// 44. 拉斯維加斯
// =====================
        Stage(
            title = "拉斯維加斯",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級魚貓)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("狗仔", "無限", 0, "90~420"),
                EnemyInfo("扭扭蛇", "無限", 0, "90~420"),
                EnemyInfo("團結筷子幫", "無限", 1200, "180~420"),
                EnemyInfo("熊熊老師（魔王）", "1", 0, "-"),
                EnemyInfo("松鼠阿嘎", "無限", 0, "30~60")
            )
        ),

// =====================
// 45. 好萊塢
// =====================
        Stage(
            title = "好萊塢",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級魚貓)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("河馬將", "無限", 0, "30~60"),
                EnemyInfo("豬野郎", "無限", 0, "30~60"),
                EnemyInfo("企鵝大哥", "無限", 1200, "300~600"),
                EnemyInfo("大猩猩", "無限", 1800, "400~900"),
                EnemyInfo("斑海豹桑", "無限", 2400, "1200~1600"),
                EnemyInfo("澎湃", "無限", 3000, "2200~3400"),
                EnemyInfo("袋拳", "無限", 3600, "1300~2400"),
                EnemyInfo("蛾蛾蛾蛾", "1", 4200, "-")
            )
        ),

// =====================
// 46. 阿拉斯加
// =====================
        Stage(
            title = "阿拉斯加",
            guide = "使用魚貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級魚貓)",
            recommendedCats = listOf("坦克貓，魚貓，龍貓"),
            enemies = listOf(
                EnemyInfo("松鼠阿嘎", "20", 0, "20~30"),
                EnemyInfo("熊熊老師", "1", 0, "-"),
                EnemyInfo("松鼠阿嘎", "無限", 0, "100~300"),
                EnemyInfo("熊熊老師", "2", 3000, "3000~4000"),
                EnemyInfo("豬野郎", "無限", 0, "1200~1800"),
                EnemyInfo("臭老兔", "無限", 0, "600~1200"),
                EnemyInfo("蛾蛾蛾蛾", "1", 0, "-")
            )
        ),

// =====================
// 47. 夏威夷
// =====================
        Stage(
            title = "夏威夷",
            guide = "使用噁心貓，龍貓進攻，並用坦克貓掩護，(滿等就換升級魚貓)",
            recommendedCats = listOf("坦克貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("團結筷子幫", "無限", 0, "2"),
                EnemyInfo("河馬將", "無限", 0, "30~60"),
                EnemyInfo("企鵝大哥", "無限", 0, "30~60"),
                EnemyInfo("大猩猩", "無限", 1800, "400~900"),
                EnemyInfo("斑海豹桑", "無限", 2400, "800~1600"),
                EnemyInfo("澎湃", "無限", 3000, "1600~3000"),
                EnemyInfo("袋拳", "無限", 3600, "900~1500"),
                EnemyInfo("一角君", "無限", 4200, "2000~2600"),
                EnemyInfo("熊熊老師", "無限", 4800, "4000~8000")
            )
        ),

// =====================
// 48. 月球（最終關）
// =====================
        Stage(
            title = "月球",
            guide = "優先存錢，先用貓咪坦克貓做阻擋，期間堆疊龍貓，噁心貓，在boss出現後開始派魚貓巨人貓(錢優先出噁心貓，龍貓)",
            recommendedCats = listOf("魚貓，噁心貓，龍貓"),
            enemies = listOf(
                EnemyInfo("團結筷子幫", "無限", 0, "30~60"),
                EnemyInfo("河馬將", "無限", 0, "200~400"),
                EnemyInfo("企鵝大哥", "無限", 0, "300~600"),
                EnemyInfo("大猩猩", "無限", 1400, "400~900"),
                EnemyInfo("袋拳", "無限", 3600, "900~1500"),
                EnemyInfo("臉君（魔王、震波）", "1", 0, "-")
            )
        ),

    )
}